// اوعي تنسي تهيش ال homeScreenLandscape

// عيد هندلة الاذكار تاني وصفحة الاذكار واشكالها وشوف ابوعبدالرحمن عاوز ايه فيها

//// to do :
/// كبر العداد 
/// ظبط مكان الtemperature
/// خلي كله small في ال copyright 
/// موضوع لوحة المفاتيح 
/// ادارة اعلانات المسجد  مكان اللوحات العرض وكل الاشياء اللي فيها نفس الاسم
/// وشيل تفعيل لوحات العرض اللي بره 
/// timer للاعلان اللي مكان الرئيسية
/// خيارات اضافية تكون اول واحدة في الخيارات بعد اسم المسجدp
// / تقويم مواقيت الهحري ظبط الالوان  وضيف السنوات القادمة وامكانية تعديلها و تعديل الصلوات يكون مباشر ويكون واحد زي + و ـ  ايوة ضيف + و -  ,, السنة لحد ٢٠٣٠
/// ظبط الاسهم اللي مش مظبوطة
/// دعاء بعد الاذان ظبطه
/// كبر العداد ويكون اوقات الصلاة والعداد اهم حاجة ولو عاوز تشيل شئ او تعدل شئ عشان العداد يكون كبير
/// وضع اسماء الصلوات في المنتصف في العرض العمودي
/// الشاشة السوداء يشوف ينعكس شكله : ممكن يكون فيها اضاءة او شئ او نسيب الخلفية فقط او اعملها شاشة مخصصة سادة او بسيطة زي الشاشة الاساسية او اقصد الخلفية الاساسية
/// بص وضع الصلاة والشغل بتعها يشتغل في وقتها حتي لو انا مش فاتح التطبيق
/// شوف لو ينفع تحفظ  شئ خاص
/// اذا اردت مواقيت الصلاة بتاعة الدمام مثلا ممكن احفظها تروح للمسجد جاهزة بدل ما يعدل هناك 
// / ادارة مواقيت الصلاة حسبت توقيت أم القري  ,,مكان توقيت الهجري
